# Сводная таблица работы алгоритмов по времени
# Решето работает значительно медленнее обычного перебора

#       |  get_simple_erat  |   get_simple  |
# ------|-------------------|---------------|
# 10    |     13.8 usec     |   6.52 usec   |
# ------|-------------------|---------------|
# 50    |     156 usec      |   70.4 usec   |
# ------|-------------------|---------------|
# 100   |     514 usec      |   206 usec    |
# ------|-------------------|---------------|
# 500   |     7.67 msec     |   1.91 msec   |
# ------|-------------------|---------------|
# 1000  |     21.8 msec     |   5.58 msec   |
# -------------------------------------------
